## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.static_web_app["events"].azurerm_static_web_app.this has changed
  ~ resource "azurerm_static_web_app" "this" {
      ~ api_key                            = (sensitive value)
      ~ app_settings                       = {
          + "DATABASE_URL"      = "mysql://u62181db2:.51kjvzyl6ma@e51980-mysql.services.easyname.eu:3307/u62181db2"
          + "PUBLIC_GITHUB_URL" = "https://github.com/davidzenisu/page-form-collections"
        }
        id                                 = "/subscriptions/0766d027-cfc5-47ae-bd61-ebbc60fd1110/resourceGroups/rg-zenisu-events/providers/Microsoft.Web/staticSites/stapp-zenisu-events"
        name                               = "stapp-zenisu-events"
      + repository_branch                  = "main"
      + repository_url                     = "https://github.com/davidzenisu/page-form-collections"
        tags                               = {}
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_federated_identity_credential.static_web_app_main_branch["radio-guesser"] will be created
  + resource "azurerm_federated_identity_credential" "static_web_app_main_branch" {
      + audience            = [
          + "api://AzureADTokenExchange",
        ]
      + id                  = (known after apply)
      + issuer              = "https://token.actions.githubusercontent.com"
      + name                = "gh-branch-main"
      + parent_id           = (known after apply)
      + resource_group_name = "rg-zenisu-radio-guesser"
      + subject             = "repo:davidzenisu/page-form-collections:ref:refs/heads/main"
    }

  # azurerm_federated_identity_credential.static_web_app_pr["radio-guesser"] will be created
  + resource "azurerm_federated_identity_credential" "static_web_app_pr" {
      + audience            = [
          + "api://AzureADTokenExchange",
        ]
      + id                  = (known after apply)
      + issuer              = "https://token.actions.githubusercontent.com"
      + name                = "gh-pullrequest"
      + parent_id           = (known after apply)
      + resource_group_name = "rg-zenisu-radio-guesser"
      + subject             = "repo:davidzenisu/page-form-collections:pull_request"
    }

  # azurerm_resource_group.static_web_app["radio-guesser"] will be created
  + resource "azurerm_resource_group" "static_web_app" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "rg-zenisu-radio-guesser"
    }

  # azurerm_static_web_app_custom_domain.static_web_app["radio-guesser"] will be created
  + resource "azurerm_static_web_app_custom_domain" "static_web_app" {
      + domain_name       = "radio.zeni-su.com"
      + id                = (known after apply)
      + static_web_app_id = (sensitive value)
      + validation_token  = (sensitive value)
      + validation_type   = "cname-delegation"
    }

  # azurerm_user_assigned_identity.static_web_app["radio-guesser"] will be created
  + resource "azurerm_user_assigned_identity" "static_web_app" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "id-stapp-zenisu-radio-guesser"
      + principal_id        = (known after apply)
      + resource_group_name = "rg-zenisu-radio-guesser"
      + tenant_id           = (known after apply)
    }

  # cloudflare_record.static_web_app["radio-guesser"] will be created
  + resource "cloudflare_record" "static_web_app" {
      + allow_overwrite = false
      + content         = (known after apply)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "radio"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "ecc59a79c63d0c89f8e64a5dfb41319a"
    }

  # module.static_web_app["events"].azurerm_static_web_app.this will be updated in-place
  ~ resource "azurerm_static_web_app" "this" {
      ~ app_settings                       = {
          - "DATABASE_URL"      = "mysql://u62181db2:.51kjvzyl6ma@e51980-mysql.services.easyname.eu:3307/u62181db2" -> null
          - "PUBLIC_GITHUB_URL" = "https://github.com/davidzenisu/page-form-collections" -> null
        }
        id                                 = "/subscriptions/0766d027-cfc5-47ae-bd61-ebbc60fd1110/resourceGroups/rg-zenisu-events/providers/Microsoft.Web/staticSites/stapp-zenisu-events"
        name                               = "stapp-zenisu-events"
        tags                               = {}
        # (12 unchanged attributes hidden)
    }

  # module.static_web_app["radio-guesser"].azurerm_role_assignment.this["gh_identity"] will be created
  + resource "azurerm_role_assignment" "this" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = false
    }

  # module.static_web_app["radio-guesser"].azurerm_static_web_app.this will be created
  + resource "azurerm_static_web_app" "this" {
      + api_key                            = (sensitive value)
      + configuration_file_changes_enabled = true
      + default_host_name                  = (known after apply)
      + id                                 = (known after apply)
      + location                           = "westeurope"
      + name                               = "stapp-zenisu-radio-guesser"
      + preview_environments_enabled       = true
      + public_network_access_enabled      = true
      + resource_group_name                = "rg-zenisu-radio-guesser"
      + sku_size                           = "Free"
      + sku_tier                           = "Free"
    }

Plan: 8 to add, 1 to change, 0 to destroy.
```
</details>